Repository: pypi-data/pypi-mirror-48
Catalog: packages/dexterity.localroles/dexterity.localroles-1.4.tar.gz/dexterity.localroles-1.4/src/dexterity/localroles/locales/*/LC_MESSAGES/dexterity.localroles.po
Languages: fr

source: A specified local role doesn't exist
fr: Un rôle local indiqué n'existe pas

source: A specified utility doesn't exist
fr: Un utilitaire indiqué n'existe pas

source: Format must be as [{'utility':'', 'roles': ['Reader', 'Reviewer']},]
fr: Le format doit être de la forme [{'utility':'', 'roles': ['Reader', 'Reviewer']},]

source: Local Role configuration
fr: Configuration des rôles locaux

source: Local role configuration
fr: Configuration des rôles locaux

source: Local role configurations successfully updated.
fr: Rôles locaux mis à jour avec succès.

source: Local roles
fr: Rôles locaux

source: No changes were made.
fr: Aucun changement effectué.

source: There is duplicate entries
fr: Il y a des entrées en double

source: Unknown principal
fr: Utilisateur ou groupe inconnu

source: related role configuration
fr: Configuration annexe

source: roles
fr: Rôles

source: state
fr: État

source: value
fr: Utilisateur ou groupe
