Repository: pypi-data/pypi-mirror-48
Catalog: packages/xblock-problem-builder/xblock_problem_builder-3.3.7-py2-none-any.whl/problem_builder/locale/*/LC_MESSAGES/text.po
Languages: pt_br

source: Long Answer
pt_br: Resposta Longa

source: Question ID (name)
pt_br: ID da Pergunta (nome)

source: The ID of this block. Should be unique unless you want the answer to be used in multiple places.
pt_br: O ID deste bloco deve ser exclusivo, a menos que você queira que a resposta seja usada em vários lugares.

source: Default From
pt_br: Padrão de

source: If a question ID is specified, get the default value from this answer.
pt_br: Se o ID de uma pergunta for especificado, obtenha o valor padrão dessa resposta.

source: Min. Allowed Characters
pt_br: Mínimo de Caracteres Permitido

source: Minimum number of characters allowed for the answer
pt_br: Número mínimo de caracteres permitido para a resposta

source: Question
pt_br: Pergunta

source: Question to ask the student
pt_br: Pergunta para o aluno

source: Long Answer Recap
pt_br: Recapitulação de Respostas Longas

source: Question ID
pt_br: ID da Pergunta

source: The ID of the question for which to display the student's answer.
pt_br: O ID da pergunta para a qual exibir a resposta do aluno.

source: Title
pt_br: Título

source: Title of this answer recap section
pt_br: Título desta seção de recapitulação de resposta

source: Description
pt_br: Descrição

source: Description of this answer (optional). Can include HTML.
pt_br: Descrição desta resposta (opcional). Pode incluir HTML.

source: Value
pt_br: Valor

source: Value of the choice when selected. Should be unique. Generally you do not need to edit this.
pt_br: Valor da opção quando selecionada. Deve ser único. Geralmente não é preciso editar isso.

source: Choice Text
pt_br: Texto da Opção

source: Human-readable version of the choice value
pt_br: Versão do valor da opção legível ao ser humano

source: Out of Context
pt_br: Fora de Contexto

source: Choice ({status})
pt_br: Opção ({status})

source: Choice ({content})
pt_br: Opção ({content})

source: No value set. This choice will not work correctly.
pt_br: Nenhum valor definido. Esta opção não funcionará corretamente.

source: No choice text set yet.
pt_br: Texto da opção ainda não definido.

source: This choice has a non-unique ID and won't work properly. This can happen if you duplicate a choice rather than use the Add Choice button.
pt_br: Esta opção tem um ID não exclusivo e não funcionará corretamente. Isso pode acontecer se você duplicar uma opção em vez de usar o botão Adicionar Opção.

source: Completion
pt_br: Conclusão

source: Mentions a specific activity and asks the student whether they completed it.
pt_br: Menciona uma atividade específica e pergunta ao aluno se ela foi concluída.

source: Please indicate whether you attended the In Person Workshop session by (un-)checking the option below.
pt_br: Indique se você participou da sessão Workshop Presencial (des)marcando a opção abaixo.

source: Answer
pt_br: Resposta

source: Represents the answer that the student can (un-)check to indicate whether they completed the activity that the question mentions.
pt_br: Representa a resposta que o aluno pode (des)marcar para indicar se completou a atividade mencionada pela pergunta.

source: Yes, I attended the session.
pt_br: Sim, participei da sessão.

source: Records student's answer.
pt_br: Registra a resposta do aluno.

source: Display Name
pt_br: Exibir Nome

source: Display name for this module
pt_br: Exibir nome para este módulo

source: Self-Assessment Summary
pt_br: Resumo da Autoavaliação

source: Mentoring Blocks
pt_br: Blocos de Mentoring

source: This should be an ordered list of the url_names of each mentoring block whose multiple choice question values are to be shown on this dashboard. The list should be in JSON format. Example: {example_here}
pt_br: Esta deve ser uma lista ordenada de url_names de cada bloco de mentoring cujos valores de perguntas de múltipla escolha devem ser mostrados neste painel. A lista deve estar no formato JSON. Exemplo: {example_here}

source: Questions to be hidden
pt_br: Perguntas a serem ocultadas

source: Optional rules to exclude specific questions both from displaying in dashboard and from the calculated average. Rules must start with the url_name of a mentoring block, followed by list of question numbers to exclude. Rule set must be in JSON format. Question numbers are one-based (the first question being number 1). Must be in JSON format. Examples: {examples_here}
pt_br: Regras opcionais para excluir perguntas específicas da exibição no painel e da média calculada. As regras devem começar com o url_name de um bloco de mentoring, seguido pela lista dos números das perguntas a serem excluídas. O conjunto de regras deve estar no formato JSON. Os números das perguntas são baseados no número um (a primeira pergunta é a número 1). Deve estar no formato JSON. Exemplos: {examples_here}

source: Color Coding Rules
pt_br: Regras de Codificação por Cores

source: Optional rules to assign colors to possible answer values and average values. One rule per line. First matching rule will be used. Light colors are recommended. Examples: {examples_here}
pt_br: Regras opcionais para atribuir cores a possíveis valores e valores médios de respostas. Uma regra por linha. A primeira regra de correspondência será usada. Recomenda-se cores claras. Exemplos: {examples_here}

source: Visual Representation
pt_br: Representação Visual

source: Optional: Enter the JSON configuration of the visual representation desired (Advanced).
pt_br: Opcional: insira a configuração JSON da representação visual desejada (Avançado).

source: Visual Representation Title
pt_br: Título da Representação Visual

source: This text is not displayed visually but is exposed to screen reader users who may not see the image.
pt_br: Este texto não é exibido visualmente, mas é exposto a usuários de leitores de tela que podem não ver a imagem.

source: Visual Repr. Description
pt_br: Descrição da Repr. Visual

source: The data represented in this image is available in the tables below.
pt_br: Os dados representados nesta imagem estão disponíveis nas tabelas abaixo.

source: This longer description is not displayed visually but is exposed to screen reader users who may not see the image.
pt_br: Esta descrição mais longa não é exibida visualmente, mas é exposta a usuários de leitores de tela que podem não ver a imagem.

source: Label for average value
pt_br: Rótulo para valor médio

source: This settings allows overriding label for the calculated average per mentoring block. Must be in JSON format. Examples: {examples_here}.
pt_br: Esta configuração permite substituir o rótulo para a média calculada por bloco de mentoring. Deve estar no formato JSON. Exemplos: {examples_here}.

source: Display values
pt_br: Mostrar valores

source: Toggles if numeric values are displayed
pt_br: Alterna se valores numéricos são exibidos

source: Header HTML
pt_br: HTML do cabeçalho

source: Custom text to include at the beginning of the report.
pt_br: Texto personalizado para incluir no início do relatório.

source: Footer HTML
pt_br: HTML do rodapé

source: Custom text to include at the end of the report.
pt_br: Texto personalizado para incluir no final do relatório.

source: Invalid color rule on line {line_number}
pt_br: Regra de cor inválida na linha {line_number}

source: Not configured.
pt_br: Não configurado.

source: Score: {score}
pt_br: Pontuação: {score}

source: No value yet
pt_br: Ainda sem valor

source: Average
pt_br: Média

source: Invalid block url_name given: "{bad_url_name}"
pt_br: url_name inválido atribuído ao bloco: "{bad_url_name}"

source: 'Questions to be hidden' is malformed: value for key {key} is {value}, expected list of integers
pt_br: "Perguntas a serem ocultadas" está malformado: o valor para a chave {key} é {value}, lista esperada de números inteiros

source: 'Questions to be hidden' is malformed: mentoring url_name {url_name} is not added to Dashboard
pt_br: "Perguntas a serem ocultadas" está malformado: o url_name {url_name} do mentoring não está adicionado ao Painel

source: 'Label for average value' is malformed: value for key {key} is {value}, expected string
pt_br: "Rótulo para valor médio" está malformado: o valor para a chave {key} é {value}, sequência esperada

source: 'Label for average value' is malformed: mentoring url_name {url_name} is not added to Dashboard
pt_br: "Rótulo para valor médio" está malformado: o url_name {url_name} do mentoring não está adicionado ao Painel

source: Visual rules contains an error: {error}
pt_br: As regras visuais contém um erro: {error}

source: Visual rules should be a JSON dictionary/object: {...}
pt_br: As regras visuais devem ser um dicionário/objeto JSON: {...}

source: Title (Display name)
pt_br: Título (Exibir nome)

source: Title to display
pt_br: Título para exibição

source: Instructor Tool
pt_br: Ferramenta do Instrutor

source: Multiple Choice Question
pt_br: Pergunta de Múltipla Escolha

source: Multiple Response Question
pt_br: Pergunta de Múltipla Resposta

source: Rating Question
pt_br: Pergunta de Avaliação

source: Could not find any of the specified usernames.
pt_br: Não foi possível encontrar nenhum dos nomes de usuário especificados.

source: Message
pt_br: Mensagem

source: General feedback provided when submitting. (This is not shown if there is a more specific feedback tip for the choice selected by the learner.)
pt_br: Feedback geral fornecido ao enviar. (Não é exibido se houver uma dica de feedback mais específica para a opção selecionada pelo aluno.)

source: Correct Choice[s]
pt_br: Opção[ões] correta[s]

source: Specify the value[s] that students may select for this question to be considered correct.
pt_br: Especifique o[s] valor[es] que os alunos podem selecionar para que esta pergunta seja considerada correta.

source: Correct
pt_br: Correto

source: Acceptable
pt_br: Aceitável

source: Wrong
pt_br: Errado

source: Not Acceptable
pt_br: Não aceitável

source: You must indicate the correct answer[s], or the student will always get this question wrong.
pt_br: Você deve indicar a[s] resposta[s] correta[s], ou o aluno sempre vai errar esta pergunta.

source: Duplicate correct choices set
pt_br: Conjunto de opções corretas duplicado

source: A choice value listed as correct does not exist: {choice}
pt_br: Um valor de opção listado como correto não existe: {choice}

source: Low
pt_br: Baixa

source: Label for low ratings
pt_br: Rótulo para classificações baixas

source: Less
pt_br: Menos

source: High
pt_br: Alta

source: Label for high ratings
pt_br: Rótulo para classificações altas

source: More
pt_br: Mais

source: Accepted Choice[s]
pt_br: Opção[ões] aceita[s]

source: Specify the rating value[s] that students may select for this question to be considered correct.
pt_br: Especifique o[s] valor[es] de classificação que os alunos podem selecionar para que esta pergunta seja considerada correta.

source: Show title
pt_br: Mostrar título

source: Display the title?
pt_br: Exibir o título?

source: Max. attempts allowed
pt_br: Máx. de tentativas permitidas

source: Maximum number of times students are allowed to attempt the questions belonging to this block
pt_br: Número máximo de vezes que os alunos podem tentar as perguntas pertencentes a este bloco

source: Weight
pt_br: Peso

source: Defines the maximum total grade of the block.
pt_br: Define a nota total máxima do bloco.

source: Followed by
pt_br: Seguido por

source: url_name of the step after the current mentoring block in workflow.
pt_br: url_name da etapa após o bloco de mentoring atual no fluxo de trabalho.

source: Enforce Dependency
pt_br: Aplicar Dependência

source: Should the next step be the current block to complete?
pt_br: A próxima etapa deve ser a conclusão do bloco atual?

source: Show Submit Button
pt_br: Mostrar Botão de Envio

source: Allow submission of the current block?
pt_br: Permitir o envio do bloco atual?

source: XML content
pt_br: Conteúdo XML

source: Not used for version 2. This field is here only to preserve the data needed to upgrade from v1 to v2.
pt_br: Não usado para a versão 2. Este campo existe apenas para preservar os dados necessários para atualização da v1 para a v2.

source: Problem Builder
pt_br: Construtor de Problemas

source: Feedback Header
pt_br: Cabeçalho do Feedback

source: Header for feedback messages
pt_br: Cabeçalho para mensagens de feedback

source: Show extended feedback details when all attempts are used up.
pt_br: Mostrar detalhes do feedback estendido quando todas as tentativas forem usadas.

source: Video
pt_br: Vídeo

source: Image Modal
pt_br: Modal de Imagem

source: Error: Unable to load child component.
pt_br: Erro: não foi possível carregar o componente filho.

source: There should only be one '{msg_type}' message component.
pt_br: Deve haver apenas um componente de mensagem '{msg_type}'.

source: A component inside this mentoring block has issues.
pt_br: Há problemas com um componente dentro deste bloco de mentoring.

source: Extended feedback
pt_br: Feedback estendido

source: Show extended feedback when all attempts are used up?
pt_br: Mostrar feedback estendido quando todas as tentativas forem usadas?

source: Title (display name)
pt_br: Título (exibir nome)

source: Step Builder
pt_br: Construtor da Etapa

source: Completed
pt_br: Concluído

source: Message (Complete)
pt_br: Mensagem (Completa)

source: Message shown when complete
pt_br: Mensagem exibida quando completa

source: Great job!
pt_br: Bom trabalho!

source: This message will be shown when the student achieves a perfect score.
pt_br: Esta mensagem será exibida quando o aluno atingir uma pontuação perfeita.

source: Incomplete
pt_br: Incompleto

source: Message (Incomplete)
pt_br: Mensagem (Incompleta)

source: Message shown when incomplete
pt_br: Mensagem exibida quando incompleta

source: Not quite! You can try again, though.
pt_br: Não é bem isso! Você pode tentar novamente.

source: This message will be shown when the student gets at least one question wrong, but is allowed to try again.
pt_br: Esta mensagem será exibida quando o aluno marcar pelo menos uma pergunta errada, mas poderá tentar novamente.

source: Reached max. # of attempts
pt_br: Nº máx. de tentativas atingido

source: Message (Max # Attempts)
pt_br: Mensagem (Nº máx. de tentativas)

source: Message shown when student reaches max. # of attempts
pt_br: Mensagem exibida quando o aluno atinge o nº máx. de tentativas

source: Sorry, you have used up all of your allowed submissions.
pt_br: Desculpe, você esgotou todos os seus envios permitidos.

source: This message will be shown when the student has used up all of their allowed attempts without achieving a perfect score.
pt_br: Esta mensagem será exibida quando o aluno tiver esgotado todas as tentativas permitidas sem obter uma pontuação perfeita.

source: Study tips if this question was wrong
pt_br: Dicas de estudo se esta pergunta estava errada

source: Study tips shown if question was answered incorrectly
pt_br: Dicas de estudo exibidas se a pergunta foi respondida incorretamente

source: Review ____.
pt_br: Revisar ____.

source: This message will be shown when the student is reviewing their answers to the assessment, if the student got this specific question wrong and is allowed to try again.
pt_br: Esta mensagem será exibida quando o aluno estiver revisando suas respostas para a avaliação, se o aluno errar esta pergunta específica e tiver permissão para tentar novamente.

source: Message to display upon completion
pt_br: Mensagem a ser exibida após a conclusão

source: Type of message
pt_br: Tipo de mensagem

source: Child
pt_br: Filho

source: The ID of this question (required). Should be unique within this mentoring component.
pt_br: O ID desta pergunta (obrigatório) deve ser exclusivo dentro deste componente de mentoring.

source: Question title
pt_br: Título da pergunta

source: Leave blank to use the default ("Question 1", "Question 2", etc.)
pt_br: Deixe em branco para usar o padrão ("Pergunta 1", "Pergunta 2", etc.)

source: Defines the maximum total grade of this question.
pt_br: Define a nota máxima total desta pergunta.

source: This XBlock does not have any settings.
pt_br: Este XBlock não tem configurações.

source: Required Choices
pt_br: Opções Obrigatórias

source: Specify the value[s] that students must select for this MRQ to be considered correct.
pt_br: Especifique o[s] valor[es] que os alunos devem selecionar para que este MRQ seja considerado correto.

source: Ignored Choices
pt_br: Opções Ignoradas

source: Specify the value[s] that are neither correct nor incorrect. Any values not listed as required or ignored will be considered wrong.
pt_br: Especifique o[s] valor[es] que não está[ão] correto[s] nem incorreto[s]. Quaisquer valores não listados como obrigatórios ou ignorados serão considerados errados.

source: General feedback provided when submitting
pt_br: Feedback geral fornecido no momento do envio

source: Required
pt_br: Obrigatório

source: Ignored
pt_br: Ignorado

source: Duplicate required choices set
pt_br: Conjunto de opções obrigatórias duplicado

source: Duplicate ignored choices set
pt_br: Conjunto de opções ignoradas duplicado

source: A choice is listed as both required and ignored: {}
pt_br: Uma opção é listada como obrigatória e ignorada: {}

source: A choice value listed as required does not exist: {}
pt_br: Um valor de opção listado como obrigatório não existe: {}

source: A choice value listed as ignored does not exist: {}
pt_br: Um valor de opção listado como ignorado não existe: {}

source: Plot
pt_br: Representação

source: Plot title
pt_br: Título da representação

source: Plot label
pt_br: Rótulo da representação

source: Label for default overlay that shows student's answers to scale questions
pt_br: Rótulo para sobreposição padrão que mostra as respostas dos alunos para dimensionar perguntas

source: Point color (default overlay)
pt_br: Cor do ponto (sobreposição padrão)

source: Point color to use for default overlay
pt_br: Cor do ponto a ser usada para sobreposição padrão

source: Point color (average overlay)
pt_br: Cor do ponto (sobreposição média)

source: Point color to use for average overlay
pt_br: Cor do ponto a ser usada para sobreposição média

source: Quadrant I
pt_br: Quadrante I

source: Label for the first quadrant. Plot uses counter-clockwise numbering starting in the top right quadrant.
pt_br: Rótulo para o primeiro quadrante. A representação usa a numeração no sentido anti-horário, começando no quadrante superior direito.

source: Quadrant II
pt_br: Quadrante II

source: Label for the second quadrant. Plot uses counter-clockwise numbering starting in the top right quadrant.
pt_br: Rótulo para o segundo quadrante. A representação usa a numeração no sentido anti-horário, começando no quadrante superior direito.

source: Quadrant III
pt_br: Quadrante III

source: Label for the third quadrant. Plot uses counter-clockwise numbering starting in the top right quadrant.
pt_br: Rótulo para o terceiro quadrante. A representação usa a numeração no sentido anti-horário, começando no quadrante superior direito.

source: Quadrant IV
pt_br: Quadrante IV

source: Label for the fourth quadrant. Plot uses counter-clockwise numbering starting in the top right quadrant.
pt_br: Rótulo para o quarto quadrante. A representação usa a numeração no sentido anti-horário, começando no quadrante superior direito.

source: Claims and associated questions
pt_br: Declarações e perguntas associadas

source: Claims and questions that should be included in the plot. Each line defines a triple of the form "claim, q1, q2", where "claim" is arbitrary text that represents a claim, and "q1" and "q2" are IDs of scale or rating questions.
pt_br: Declarações e perguntas que devem ser incluídas na representação. Cada linha define uma tupla do formulário "claim, q1, q2", em que "claim" é um texto arbitrário que representa uma declaração e "q1" e "q2" são IDs de perguntas de escala ou de classificação.

source: In addition to the default and average overlays the plot includes the following overlays:
pt_br: Além das sobreposições padrão e média, a representação inclui as seguintes sobreposições:

source: Plot Overlay
pt_br: Sobreposição da Representação

source: Overlay title
pt_br: Título da sobreposição

source: Label for button that allows to toggle visibility of this overlay
pt_br: Rótulo para botão que permite alternar a visibilidade dessa sobreposição

source: Point color
pt_br: Cor do ponto

source: Point color to use for this overlay
pt_br: Cor do ponto a ser usada para esta sobreposição

source: Description of this overlay (optional)
pt_br: Descrição desta sobreposição (opcional)

source: Citation
pt_br: Citação

source: Source of data belonging to this overlay (optional)
pt_br: Fonte de dados pertencentes a esta sobreposição (opcional)

source: Claim data
pt_br: Dados da declaração

source: Claim data to include in this overlay. Each line defines a tuple of the form "q1, q2", where "q1" is the value associated with the first scale or rating question, and "q2" is the value associated with the second scale or rating question. Note that data will be associated with claims in the order that they are defined in the parent plot.
pt_br: Dados da declaração para incluir nesta sobreposição. Cada linha define uma tupla do formato "q1, q2", em que "q1" é o valor associado à primeira pergunta de escala ou de classificação e "q2" é o valor associado à segunda pergunta de escala ou de classificação. Observe que os dados serão associados às declarações na ordem em que são definidos na representação pai.

source: No plot label set. Button for toggling visibility of this overlay will not have a label.
pt_br: Nenhum conjunto de rótulos de representação. O botão para alternar a visibilidade desta sobreposição não terá um rótulo.

source: No point color set. This overlay will not work correctly.
pt_br: Nenhum conjunto de cores de ponto. Esta sobreposição não funcionará corretamente.

source: No claim data provided. This overlay will not work correctly.
pt_br: Nenhum dado de declaração fornecido. Esta sobreposição não funcionará corretamente.

source: A unique Question ID is required.
pt_br: Um ID de Pergunta exclusivo é obrigatório.

source: Question ID should not contain spaces.
pt_br: O ID de Pergunta não deve conter espaços.

source: Some choice values are not unique.
pt_br: Alguns valores de opção não são exclusivos.

source: Multiple tips configured for the same choice.
pt_br: Várias dicas configuradas para a mesma opção.

source: Ranged Value Slider
pt_br: Controle deslizante de valor da variação

source: Label for low end of the range
pt_br: Rótulo para extremidade inferior da variação

source: Label for high end of the range
pt_br: Rótulo para extremidade superior da variação

source: Question to ask the student (optional)
pt_br: Pergunta para o aluno (opcional)

source: Select a value from {min_label} to {max_label}
pt_br: Selecione um valor de {min_label} até {max_label}

source: Step
pt_br: Etapa

source: Mentoring Step
pt_br: Etapa de Mentoring

source: Step Title
pt_br: Título da Etapa

source: Leave blank to use sequential numbering
pt_br: Deixe em branco para usar a numeração sequencial

source: Next Button Label
pt_br: Rótulo do Botão Próximo

source: Customize the text of the 'Next' button.
pt_br: Personalize o texto do botão "Próximo".

source: Next Step
pt_br: Próxima Etapa

source: Feedback or instructional message which pops up after submitting.
pt_br: Feedback ou mensagem instrucional que aparece após o envio.

source: Conditional Message
pt_br: Mensagem Condicional

source: Show only if student got a perfect score
pt_br: Mostrar apenas se o aluno obteve uma pontuação perfeita
