Repository: pypi-data/pypi-mirror-48
Catalog: packages/xblock-problem-builder/xblock_problem_builder-3.3.7-py2-none-any.whl/problem_builder/locale/*/LC_MESSAGES/text.po
Languages: pt_br

source: Show only if student got at least one question wrong
pt_br: Mostrar apenas se o aluno teve pelo menos uma pergunta errada

source: Show for any score
pt_br: Mostrar para qualquer pontuação

source: Score condition
pt_br: Condição de pontuação

source: Show only if student can try again
pt_br: Mostrar apenas se o aluno puder tentar novamente

source: Show only if student has used up all attempts
pt_br: Mostrar apenas se o aluno tiver esgotado todas as tentativas

source: Show whether student can try again or not
pt_br: Mostrar se o aluno puder tentar de novo ou não

source: Try again condition
pt_br: Condição para tentar novamente

source: Always shown
pt_br: Sempre exibido

source: Score Summary
pt_br: Resumo da pontuação

source: Per-Question Feedback
pt_br: Feedback por pergunta

source: (Example tip:) Since you got Question 1 wrong, review Chapter 12 of your textbook.
pt_br: (Dica de exemplo:) Como você errou a Pergunta 1, revise o Capítulo 12 do seu livro-texto.

source: Review Step
pt_br: Revisar etapa

source: Swipeable Binary Choice Question
pt_br: Pergunta de Opção Binária Deslizável

source: Text
pt_br: Texto

source: Text to display on this card. The student must determine if this statement is true or false.
pt_br: Texto para exibição neste cartão. O aluno deve determinar se esta afirmação é verdadeira ou falsa.

source: Image
pt_br: Imagem

source: Specify the URL of an image associated with this question.
pt_br: Especifique o URL de uma imagem associada a esta pergunta.

source: Correct Choice
pt_br: Opção Correta

source: Specifies whether the card is correct.
pt_br: Especifica se o cartão está correto.

source: Correct Answer Feedback
pt_br: Feedback da Resposta Correta

source: Feedback to display when student answers correctly.
pt_br: Feedback para exibição quando o aluno responder corretamente.

source: Incorrect Answer Feedback
pt_br: Feedback de Resposta Incorreta

source: Feedback to display when student answers incorrectly.
pt_br: Feedback para exibição quando o aluno responder incorretamente.

source: Last input submitted by the student.
pt_br: Última entrada enviada pelo aluno.

source: Answer Recap Table
pt_br: Tabela de Recapitulação da Resposta

source: Display name
pt_br: Exibir nome

source: Title of the table
pt_br: Título da tabela

source: Answers Table
pt_br: Tabela de Respostas

source: Special Mode
pt_br: Modo Especial

source: Variant of the table that will display a specific background image.
pt_br: Variante da tabela que exibirá uma imagem de plano de fundo específica.

source: Allow Download
pt_br: Permitir Download

source: Allow students to download a copy of the table for themselves.
pt_br: Permita que os alunos façam o download de uma cópia da tabela por conta própria.

source: Allow Sharing
pt_br: Permitir Compartilhamento

source: Allow students to share their results with other students.
pt_br: Permita que os alunos compartilhem seus resultados com outros alunos.

source: You are not permitted to view this student's table.
pt_br: Você não tem permissão para visualizar a tabela deste aluno.

source: Usernames not provided.
pt_br: Nomes de usuário não fornecidos.

source: Some users could not be shared with. Please check these usernames: {}
pt_br: Alguns usuários não puderam ser compartilhados. Verifique esses nomes de usuário: {}

source: Username not provided.
pt_br: Nome de usuário não fornecido.

source: Removed successfully.
pt_br: Removido com sucesso.

source: Header
pt_br: Cabeçalho

source: Header of this column
pt_br: Cabeçalho desta coluna

source: Incorrect
pt_br: Incorreto

source: No answer yet.
pt_br: Nenhuma resposta ainda.

source: Complete
pt_br: Concluído

source: Download report
pt_br: Fazer download do relatório

source: Student
pt_br: Aluno

source: Course
pt_br: Curso

source: Date
pt_br: Data

source: Filters
pt_br: Filtros

source: Username[s]:
pt_br: Nome[s] de usuário[s]:

source: Enter one or more usernames, comma separated.
pt_br: Digite um ou mais nomes de usuários, separados por vírgulas.

source: Text:
pt_br: Texto:

source: Section/Question:
pt_br: Seção/Pergunta:

source: All
pt_br: Tudo

source: Problem types:
pt_br: Tipos de problemas:

source: Search
pt_br: Pesquisar

source: Section
pt_br: Seção

source: Subsection
pt_br: Subseção

source: Unit
pt_br: Unidade

source: Type
pt_br: Tipo

source: Username
pt_br: Nome de usuário

source: First
pt_br: Primeiro

source: Prev
pt_br: Anterior

source: Next
pt_br: Próximo

source: Last
pt_br: Último

source: Download as CSV
pt_br: Fazer download como CSV

source: Cancel search
pt_br: Cancelar pesquisa

source: Delete results
pt_br: Excluir resultados

source: Add HTML
pt_br: Adicionar HTML

source: Add Answer Recap
pt_br: Adicionar Recapitulação de Resposta

source: Add Answer Recap Column
pt_br: Adicionar Coluna de Recapitulação de Resposta

source: Display Map from:
pt_br: Exibir mapa de:

source: You (%(username)s)
pt_br: Você (%(username)s)

source: Share
pt_br: Compartilhar

source: Enter the username of another student you'd like to share this with:
pt_br: Digite o nome de usuário de outro aluno com quem você gostaria de compartilhar:

source: Map added!
pt_br: Mapa adicionado!

source: Another user has shared a map with you.
pt_br: Outro usuário compartilhou um mapa com você.

source: You can change the user you're currently displaying using the drop-down selector above.
pt_br: É possível alterar o usuário que você está exibindo no momento usando o seletor suspenso acima.

source: Shared with:
pt_br: Compartilhado com:

source: You need to complete %(link_start)sthe previous step%(link_end)s before attempting this step.
pt_br: Você precisa concluir %(link_start)sa etapa anterior%(link_end)s antes de tentar esta etapa.

source: Submit
pt_br: Enviar

source: Review final grade
pt_br: Revisar nota final

source: APGLv3 license
pt_br: Licença APGLv3

source: url_name for linking to this mentoring question set:
pt_br: url_name para vincular a este conjunto de perguntas de mentoring:

source: Partially correct
pt_br: Parcialmente correta

source: Review grade
pt_br: Revisar nota

source: Try again
pt_br: Tentar novamente

source: Overlay
pt_br: Sobreposição

source: Description:
pt_br: Descrição:

source: No description provided
pt_br: Nenhuma descrição fornecida

source: Source:
pt_br: Fonte:

source: No citation provided
pt_br: Nenhuma citação fornecida

source: Data:
pt_br: Dados:

source: No data provided
pt_br: Nenhum dado fornecido

source: Quadrant labels
pt_br: Rótulos dos quadrantes

source: Compare your plot to others!
pt_br: Compare sua representação com outras!

source: Plot info
pt_br: Informações da representação

source: This block displays a plot that summarizes responses to the following claims:
pt_br: Este bloco exibe uma representação que resume as respostas às seguintes declarações:

source: Claim
pt_br: Declaração

source: Question 1
pt_br: Pergunta 1

source: Question 2
pt_br: Pergunta 2

source: This block displays a plot that summarizes responses to a set of claims.
pt_br: Este bloco exibe uma representação que resume as respostas para um conjunto de declarações.

source: Add Custom Choice
pt_br: Adicionar Opção Personalizada

source: Add Tip
pt_br: Adicionar Dica

source: Message (Review)
pt_br: Mensagem (Revisão)

source: ID for referencing this rating block:
pt_br: ID para referenciar este bloco de classificação:

source: Built-in choices:
pt_br: Opções internas:

source: Additional custom choices and tips:
pt_br: Opções e dicas personalizadas adicionais:

source: You might consider reviewing the following items before your next assessment attempt:
pt_br: Considere revisar os seguintes itens antes de tentar uma nova avaliação:

source: You scored %(score)s%% on this assessment.
pt_br: Você obteve %(score)s%% nesta avaliação.

source: Click a question to review feedback on your response.
pt_br: Clique em uma pergunta para revisar o feedback sobre sua resposta.

source: Note: This is an example score, to show how the review step will look.
pt_br: Observação: esta é uma pontuação de exemplo para mostrar como será a etapa de revisão.

source: You answered 1 question correctly.
pt_br: Você respondeu %(correct_answers)s pergunta corretamente.

source: and
pt_br: e

source: Question %(number)s
pt_br: Pergunta %(number)s

source: You answered 1 question partially correctly.
pt_br: Você respondeu %(partially_correct_answers)s pergunta parcialmente correta.

source: You answered 1 question incorrectly.
pt_br: Você respondeu %(incorrect_answers)s pergunta incorretamente.

source: ID for referencing this slider:
pt_br: ID para referenciar este controle deslizante:

source: Content
pt_br: Conteúdo

source: Text of the tip to show if the student chooses this tip's associated choice[s]
pt_br: Texto da dica para exibição se o aluno escolher a[s] opção[ões] associada[s] à[s] dica[s]

source: For Choices
pt_br: Para Opções

source: List of choices for which to display this tip
pt_br: Lista de opções para as quais exibir esta dica

source: Width
pt_br: Largura

source: Width of the tip popup (e.g. '400px')
pt_br: Largura do pop-up da dica (p. ex., "400px")

source: Height
pt_br: Altura

source: Height of the tip popup (e.g. '200px')
pt_br: Altura do pop-up da dica (p. ex., "200px")

source: Tip for {list_of_choices}
pt_br: Dica para {list_of_choices}

source: A choice selected for this tip does not exist.
pt_br: Não existe uma opção selecionada para esta dica.
