Repository: pypi-data/pypi-mirror-48
Catalog: packages/django-sitemenu/django-sitemenu-0.1.0.tar.gz/django-sitemenu-0.1.0/sitemenu/locale/*/LC_MESSAGES/django.po
Languages: lv

source: title
lv: nosaukums

source: Unexpected error.
lv: Kļūda

source: Wrong position.
lv: Nepareiza vieta.

source: Item moved.
lv: Objekts pārvietots.

source: sort
lv: pozicija

source: parent
lv: vecāks

source: date added
lv: pievienošanās datums

source: date modified
lv: modificēšanas datums

source: page type
lv: lapas veids

source: h1 title
lv: H1 virsraksts

source: page title
lv: Loga virsraksts

source: content
lv: saturs

source: redirect url
lv: Pāradresācijas URL

source: redirect to first child
lv: Pāradresēt uz pirmo

source: enabled
lv: aktīvs

source: show in top menu
lv: Rādīt augšējā izvēlnē

source: show in bottom menu
lv: Rādīt apakšējā izvēlnē

source: menu
lv: lapa

source: menus
lv: lapas

source: Page "Parent" can't be same as page
lv: Lapas "vecāks" nevar rādīt uz sevi

source: This field is required.
lv: Šīs lauks ir obligāts.

source: At least one field must be filled.
lv: Nepieciešams aizpildīt vismaz vienu lauku.

source: message
lv: ziņa

source: date
lv: datums

source: first name
lv: vārds

source: email
lv: e-pasts

source: phone
lv: tālrunis

source: feedback form
lv: kontaktu forma

source: feedback forms
lv: kontaktu formas

source: send
lv: nosūtīt

source: Feedback form sent.
lv: Jūsu informācija veiksmīgi nosūtīta.
